In [3]:
import pandas as pd

In [7]:
df = pd.read_csv('data/gapminder.tsv',sep='\t')

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
# 앞에서 N개
df.head(2)

       country continent  year  lifeExp      pop   gdpPercap
0  Afghanistan      Asia  1952   28.801  8425333  779.445314
1  Afghanistan      Asia  1957   30.332  9240934  820.853030

In [10]:
# 뒤에서 N개
df.tail(2)

       country continent  year  lifeExp       pop   gdpPercap
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [11]:
# 형태 
df.shape

(1704, 6)

In [12]:
# column 명 list 형태로
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [13]:
df.values

array([['Afghanistan', 'Asia', 1952, 28.801, 8425333, 779.4453145],
       ['Afghanistan', 'Asia', 1957, 30.332, 9240934, 820.8530296],
       ['Afghanistan', 'Asia', 1962, 31.997, 10267083, 853.10071],
       ...,
       ['Zimbabwe', 'Africa', 1997, 46.809, 11404948, 792.4499603],
       ['Zimbabwe', 'Africa', 2002, 39.989, 11926563, 672.0386227],
       ['Zimbabwe', 'Africa', 2007, 43.487, 12311143, 469.7092981]],
      dtype=object)

In [ ]:
df.index

In [14]:
df.dtypes

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [19]:
df['country']
df['country'].shape

(1704,)

In [20]:
# 2개이상은 대괄호 2개 이상
df[['country','lifeExp']]

          country  lifeExp
0     Afghanistan   28.801
1     Afghanistan   30.332
2     Afghanistan   31.997
3     Afghanistan   34.020
4     Afghanistan   36.088
...           ...      ...
1699     Zimbabwe   62.351
1700     Zimbabwe   60.377
1701     Zimbabwe   46.809
1702     Zimbabwe   39.989
1703     Zimbabwe   43.487

[1704 rows x 2 columns]

In [22]:
# df.loc[행,열]
# df.loc[1]
df.loc[1,'country']

'Afghanistan'

In [28]:
# 모든 행의 country 값 가져오기
# df.loc[:,'country']
# df.loc[:,:]
# df.loc[1:10,'country':'year']
df.loc[[1,2,3],['country','lifeExp']]

       country  lifeExp
1  Afghanistan   30.332
2  Afghanistan   31.997
3  Afghanistan   34.020

In [31]:
# df.iloc[[0,1,2],[0,2]]
# df.iloc[1:10,1:3]
df.iloc[1:10,1:-1]

  continent  year  lifeExp       pop
1      Asia  1957   30.332   9240934
2      Asia  1962   31.997  10267083
3      Asia  1967   34.020  11537966
4      Asia  1972   36.088  13079460
5      Asia  1977   38.438  14880372
6      Asia  1982   39.854  12881816
7      Asia  1987   40.822  13867957
8      Asia  1992   41.674  16317921
9      Asia  1997   41.763  22227415

In [35]:
# df.sum() >> 합구하기 , 문자열도 더해진 상태로 나옴
# df[['pop','lifeExp']].mean() >> 평균 구하기

pop        2.960121e+07
lifeExp    5.947444e+01
dtype: float64

In [ ]:
df.groupby('year')['lifeExp']